{
  "articles": [
    {
      "teamName": "New York Jets",
      "playerName": "Breece Hall",
      "articleTitle": "2025 NFL trade deadline: Breece Hall, Alvin Kamara among 5 running backs teams should target",
      "sourceURL": "https://www.nfl.com/news/2025-nfl-trade-deadline-5-running-backs-teams-should-target-now",
      "sourceHost": "nfl.com",
      "date": "2025-09-24",
      "bodyText": "NFL.com Analyst The first three weeks of the 2025 NFL season have been rough on running backs. Washington's Austin Ekeler (Achilles), Arizona's James Conner (ankle) and the Los Angeles Chargers' Najee Harris (Achilles) all sustained season-ending injuries, while New York Giants' Tyrone Tracy Jr. suffered a dislocated shoulder Sunday night, which will force him to miss some time. This all means we could see some backs on the move ahead of the NFL trade deadline on Tuesday, Nov. 4. To get a sense of who might be gone by November, I scanned all 32 NFL rosters looking at factors like team competitiveness, depth charts, contract status and player performance. Below are the five running backs who stood out to me as potential trade targets. Let's start making some calls, GMs! There was speculation back in August that the Jets could potentially trade Hall, but head coach Aaron Glenn dismissed the notion and said they would utilize all three of their RBs -- Hall and 2024 draft picks ï»¿ï»¿ï»¿Braelon Allenï»¿ï»¿ï»¿ and Isaiah Davis. Three weeks into the season, OC Tanner Engstrand has indeed spread the rock around, and New York's run game is one of the few bright spots, ranking ninth in rush yards and rush TDs. Hall leads the team in carries (38) and rush yards (157) -- but has yet to get into the end zone -- while Allen and Davis have combined for just 16 attempts. Most of the other carries have gone to quarterbacks ï»¿ï»¿ï»¿Justin Fieldsï»¿ï»¿ï»¿, who missed Week 3 with a concussion, and ï»¿ï»¿ï»¿Tyrod Taylorï»¿ï»¿ï»¿. Little has gone well so far for the 2025 Jets, who dwell in the AFC East cellar alongside the also winless Dolphins. Hall is in the final year of his rookie contract and knows he's not the new regime's guy. His potential departure in the coming weeks would allow Allen and Davis to take on bigger roles in Engstrand's offense and net New York some quality draft capital, as well. Hall is a big back who can do everything asked of him as a rusher and receiver out of the backfield. In fact, the fourth-year pro sits second on the Jets in targets (13), receptions (eight) and receiving yards (78). There are a ton of teams that could use RB help right now -- Bears, Cardinals, Chargers, Chiefs, Commanders, Steelers and Vikings among them -- and Hall, whose best days I believe are ahead of him, would be an asset almost anywhere. Kamara has made it known he wants to play for the Saints and the Saints alone. The five-time Pro Bowl running back has been the focal point of New Orleans' offense since he was drafted in 2017, and he's been incredibly steady despite all of the offensive changes during his nine seasons. The 30-year-old still brings great value as a dual-threat running back who defenses must account for on every play. Unfortunately, no matter how great Kamara still is, he can't stack up wins for New Orleans (0-3) without a lot more help. The Saints are in full rebuild mode -- they could very well be in the quarterback market once again next offseason -- and need as many assets as they can get. Kamara's trade value might not be nearly as high as it once was, but by moving the experienced playmaker, New Orleans would pick up draft capital and free up some cap space. The team that should seriously consider calling GM Mickey Loomis? Kansas City. Kamara could be the answer to many of the Chiefs' offensive problems. Teams don't usually want to part with young, versatile playmakers like Achane. But if things continue to go sideways down in South Beach, and rookie Ollie Gordon II keeps building on his early promise, dealing Achane could become more palatable for Miami's front office. The third-year pro routinely flashes speed between the tackles and after the catch, leading all RBs in targets (110), receptions (96), receiving yards (733) and receiving TDs (8) since 2024. Like Hall and Kamara, the do-it-all back undoubtedly would be an asset for multiple playoff contenders, including the Chiefs, Cardinals and Commanders -- if the Fins are open to a trade. It's no secret the 0-3 Titans are still a work-in-progress. Rookie quarterback Cam Ward is still getting his feet wet as a pro, and head coach Brian Callahan just handed over play-calling duties to quarterbacks coach Bo Hardegree. Although Tennessee would surely miss Pollard's steady presence, dealing the veteran -- who's on pace for a career-best rushing total and whose contract includes zero guaranteed money in 2026 -- might make sense long-term. The Titans would likely want to hold off on making a move at least until ï»¿ï»¿Tyjae Spearsï»¿ï»¿ returns to the lineup. Spears, who began the season on IR due to a preseason ankle injury, is capable of shouldering a large load beyond his typical third-down duties. I'll admit there are a few factors working against a potential Etienne trade. First off, despite the offseason trade chatter, Etienne has thrived in Jacksonville's new offense and ranks third in the NFL in rushing yards (270) through three weeks. And second, the Jags already traded one of their backs, Tank Bigsby, to Philadelphia earlier this season. But everyone has a price. If Jacksonville is willing to listen to offers and, in turn, ends up moving Etienne (a free agent in 2026), the team will still have a pair of young running backs who have showed promise. Rookies Bhayshul Tuten and LeQuint Allen Jr. could be the future of Liam Coen's backfield, with Tuten flashing some major potential already as a runner and pass catcher. Do the Jags think their 2025 fourth-round pick is ready for RB1 duties? If yes, Etienne could be available. With the NFL season set to kick off, Maurice Jones-Drew reveals his picks for the top 10 leading rushers of 2025. Will Saquon Barkley earn back-to-back rushing titles? Which rookies make his list? With the ground game back in vogue, Maurice Jones-Drew ranks all 32 RB1s heading into the 2025 NFL season. Who's No. 1? Is Omarion Hampton or Ashton Jeanty the top-rated rookie running back? Maurice Jones-Drew ranks all 74 starting running backs from the 2024 NFL season. Where does veteran Josh Jacobs land after an impressive first campaign in Green Bay? Does Giants rookie Tyrone Tracy Jr. crack the top 25? Maurice Jones-Drew provides team fits for six pending free agents at the running back position. Where is the perfect landing spot for Najee Harris? Which ball-carrier could help Ben Johnson push the Bears' offense forward? Maurice Jones-Drew ranks each team's primary running back from the 2024 NFL season. Where does do-it-all playmaker Jahmyr Gibbs land? How about rookie Bucky Irving? Check out the entire ranking, 1-32. Maurice Jones-Drew identifies five teams that need to upgrade their running back rooms this offseason. Plus, MJD updates his RB rankings heading into Week 18 of the NFL season. Maurice Jones-Drew updates his top 15 RB rankings heading into Week 16 of the NFL season. Minnesota's Aaron Jones re-enters the rankings for the first time since Week 8. Where does he land? Maurice Jones-Drew updates his top 15 RB rankings heading into the final quarter of the NFL season, with a rookie making an appearance on his list for the first time this season. Could Saquon Barkley be the first running back since 2012 to win the NFL MVP award? Maurice Jones-Drew thinks there is one thing standing in his way. Plus, MJD updates his top 15 RB rankings heading into Week 12 of the NFL season, which includes a new No. 1. Maurice Jones-Drew reveals two running backs poised to break out in the second half of the 2024 NFL season. Plus, MJD updates his top 15 RB rankings heading into Week 11 of the NFL season. Maurice Jones-Drew identifies three running backs with season-saving potential for their teams. Plus, MJD updates his top 15 RB rankings -- a list that includes two new names -- heading into Week 9 of the NFL season.",
      "summary": "Injuries to several running backs like Austin Ekeler, James Conner, and Najee Harris have opened up the possibility of trades before the November 4th deadline, with players like Breece Hall, Alvin Kamara, De'Von Achane, Tony Pollard, and Travis Etienne identified as potential trade targets. Teams like the Chiefs, Cardinals, Commanders, Bears, Chargers, and Steelers are highlighted as potential destinations for these running backs, as many are seeking to bolster their ground game.",
      "sentiment": "Positive"
    },
    {
      "teamName": "Denver Broncos",
      "playerName": "Broncos",
      "articleTitle": "Bengals and Broncos seek to bounce back after crushing defeats",
      "sourceURL": "http://www.espn.com/nfl/preview?gameId=401772716",
      "sourceHost": "espn.com",
      "date": "2025-09-25",
      "bodyText": "ABC DENVER -- — The medicine comes Monday night for the Cincinnati Bengals or the Denver Broncos. The Bengals (2-1) are coming off the worst loss in franchise history, a 48-10 drubbing at the hands of the Minnesota Vikings in their first game since franchise quarterback Joe Burrow suffered a toe injury that required surgery. The Broncos (1-2) have lost on walk-off field goals in back-to-back games despite never trailing in the fourth quarter. Denver failed to close out the Colts and the Chargers on the road. The Broncos' five combined fourth-quarter drives in those games netted a missed 42-yard field goal indoors, two three-and-outs, a red-zone interception and a chip-shot field goal that followed first-and-goal from the 5. Last week, Bo Nix overthrew a wide-open receiver three times on deep balls in Denver's 23-20 loss, hallmarks of a sputtering start that's raised questions about whether coach Sean Payton put too much on Nix's plate or his shoulders by talking up his second-year quarterback and the Broncos' Super Bowl chances. “I don't think so,” Nix said Thursday. “I think it's better than him talking about how tough of a season it's going to be. So, I'd rather have the confidence going in and have the whole season to play and just get to go out there and play it out (rather than) a coach that doesn't really have the confidence in us.” Addressing Nix's overthrows — and his footwork on the heaves — was about 50th on Payton's to-do list this week and Nix said he wasn't overly concerned about them, either. “I know I'm going to miss several throws in the future and I'm probably going to miss a few deep ones,” Nix said. “I've just got to keep throwing them.” The Bengals won their first two games but lost Burrow in Week 2 and were awful last week at Minnesota, turning the ball over five times. They surrendered two defensive touchdowns and the other three gaffes resulted in 17 more Vikings points. Jake Browning has already thrown five interceptions in the seven quarters he has played. Coach Zac Taylor said the game plan doesn’t change much with Browning in for Burrow, but Cincinnati will need to be more balanced on offense. The Bengals are averaging only 2.4 yards per carry, and lead back Chase Brown is getting hit behind the line of scrimmage on nearly 80% of his carries. Brown is averaging only 2 yards per carry through three games. “I think it’s unfair to put it on a player,\" Taylor said. \"It’s on all of us offensively, collectively, to find a better answer.” Uncorking Higgins Cincinnati receiver Tee Higgins has just seven receptions for 104 yards so far and last week he caught just one of two passes thrown his way for 15 yards. But a trip to Denver might just be the antidote. Last December, he caught 11 passes for 131 yards and three TDs in the Bengals' 30-24 overtime win over the Broncos. He had a dozen targets in that game alone but has 14 combined targets in 2025. “That’s the thing about our guys, there’s not an ego involved in any of this,” Taylor said. “There’s been games before where some of our main guys have caught a ball or have been targeted once. They know the next game might be 12 targets and 10 catches.” Mile High magic The Broncos have won six consecutive home games, prompting wide receiver Courtland Sutton to declare, \"They don't call it home-field advantage for nothing.” Part of that advantage is the altitude. “Our guys understand what it’s gonna feel like a little bit,” Taylor said. “You can get winded. Countless times I’ve been there. ... So as the game goes, you just have to be mindful of which guys are getting a lot of reps and try to give them breaks when you can.” Close-out conundrums A play here, a play there, and the Broncos would be among the league's 3-0 teams. “I think that's the crazy thing,” Nix said. \"We've played really good opponents and we've led in the end of the game. We're one play in the fourth quarter away from putting the game out of reach. It's going to be soon that we make that play. “But we definitely have to learn from these losses and learn why we're not finishing the game, learn why we're not putting the game out (reach). When you play a good team and you don't do that and you keep letting them hang around, they're going to find a play. So, we've got to be the team that finds that play.” ------ AP Sports Writer Joe Reedy contributed to this report. ------ AP NFL: https://apnews.com/hub/NFL Denver, CO 72° 3h 6h 9h",
      "summary": "The Cincinnati Bengals and Denver Broncos are both looking for a bounce-back win on Monday night. The Bengals are coming off a significant loss after Joe Burrow's injury, while the Broncos have lost two straight games on walk-off field goals despite leading in the fourth quarter.",
      "sentiment": "Negative"
    },
    {
      "teamName": "Denver Broncos",
      "playerName": "Broncos",
      "articleTitle": "Broncos' Payton backs Bo Nix amid struggles: 'Just keep firing'",
      "sourceURL": "https://www.espn.com/nfl/story/_/id/46381627/broncos-payton-backs-bo-nix-amid-struggles-just-keep-firing",
      "sourceHost": "espn.com",
      "date": "2025-09-25",
      "bodyText": "ENGLEWOOD, Colo. -- Denver Broncos coach Sean Payton defended quarterback Bo Nix's mechanics Thursday with the promise that big plays will come. But Payton said the offense's biggest problem is that it hasn't found its identity, and that has been affecting Nix, as well. The Broncos have lost back-to-back games on the last play -- to the Indianapolis Colts and the Los Angeles Chargers -- and Nix's play has been scrutinized because of the offense's struggles. He is 25th in the league in QBR (41.8), and, according to NextGen, his tight-window completion percentage is 16th (37.5%), tied with recently benched Giants quarterback Russell Wilson. Nix narrowly missed multiple potential big plays in the loss to the Chargers on Sunday, all on overthrows, including one to a wide-open Courtland Sutton in the fourth quarter that would have likely sealed a win. The Broncos also had seven possessions in which they totaled 9 or fewer yards and four possessions in which they had 1 yard or fewer. Asked Thursday about Nix's mechanics through three games, Payton encouraged him to \"just keep firing.\" \"He's going to hit plenty of those. ... [And] there's times I'm sure when we sit and watch the tape [there are things to repair],\" Payton said. \"But one of the things that's a gift are his off-schedule throws, but you just want to be careful of how much you tell him. When you settle into certain plays, there's a rhythm to the mechanics. ... But overall, I think [the ball] is coming out well.'' Payton said the Broncos' real struggle is more of a big-picture situation. The team is 27th in third-down conversions and average yards to go on third down, and 19th in big plays (runs of 10 or more yards and passes of 20 or more yards) and passing yards per game. The Broncos are also one of the most penalized offenses in the league with 14. Though they are eighth in the league in rushing yards per game (129.0), they are 20th in attempts. Payton said it's all part of an offensive rhythm and \"identity'' the team hasn't found. He said it's on the coaches to help the team establish one. The Broncos face the Cincinnati Bengals (2-1) on Monday night in Empower Field at Mile High. \"Ultimately, you want to go out there and hit every single one of them,\" Nix said of the missed big plays. \"I've yet to actually play a game where I've hit all of them. But I'm working on that, and I feel confident that one day I can go out there and do it. And that may be crazy on my part, but I truly believe it.\"",
      "summary": "Broncos coach Sean Payton defended Bo Nix's mechanics despite recent struggles and missed big plays, emphasizing that the team's bigger issue is a lack of offensive identity. Nix expressed confidence that he will eventually improve his accuracy on big plays.",
      "sentiment": "Negative"
    },
    {
      "teamName": "Los Angeles Rams",
      "playerName": "Matthew Stafford",
      "articleTitle": "Daniel Jones' Colts take perfect start to LA to face Matthew Stafford, Rams",
      "sourceURL": "http://www.espn.com/nfl/preview?gameId=401772849",
      "sourceHost": "espn.com",
      "date": "2025-09-25",
      "bodyText": "FOX Indianapolis (3-0) at Los Angeles Rams (2-1) Sunday, 4:05 p.m. EDT, FOX NFL Odds: Rams by 3 1/2 Against the spread: Colts 3-0; Rams 2-1 Series record: Colts lead 23-22-2. Last meeting: Rams beat Colts 29-23 in Indianapolis on Oct. 1, 2023. Last week: Colts beat Titans 41-20; Rams lost to Eagles 33-26. Colts offense: overall (2), rush (3), pass (4), scoring (T-2). Colts defense: overall (7), rush (8), pass (8), scoring (T-9). Rams offense: overall (5), rush (T-9), pass (10), scoring (11). Rams defense: overall (5), rush (13), pass (6), scoring (14). Turnover differential: Colts plus-5; Rams plus-1. Colts player to watch Michael Pittman Jr. The sixth-year receiver finally looks healthy after dealing with a back injury most of last season. QB Daniel Jones has looked his direction more often the past couple of weeks and Pittman has responded with two TD catches in the past three games and some strong runs after the catch. Rams player to watch OLB Jared Verse shook off a slow start to the season by getting his first sack and two tackles for loss in addition to forcing a fumble in the loss to the Eagles. The Rams need Verse and edge rushing counterpart Byron Young to turn up the pressure on Colts QB Daniel Jones, who has been sacked on a league-low 2.3% of his drop-backs. Key matchup Rams offense vs. Colts red zone defense. With a more effective scoring touch inside the 20 against Philadelphia, Los Angeles could have cruised to a win over the defending Super Bowl champs. However, in four trips into the red zone, QB Matthew Stafford and the offense could only generate one touchdown and two field goals, with four points lost on center Coleman Shelton’s holding penalty that negated a scoring run by Kyren Williams. Indianapolis has allowed touchdowns on all six such opportunities faced this season, so whichever group is able to get on track should have a major edge. Key injuries Indy’s biggest questions this week are whether WR Alec Pierce will clear concussion protocol in time to suit up Sunday and the severity of Pro Bowl CB Kenny Moore II’s calf injury. Coach Shane Steichen said he didn’t expect Moore to be placed on injured reserve but also did not provide a timetable for his return. Rookie TE Tyler Warren (toe) played last week despite being on the mid-week injury list. ... Rams LG Steve Avila could return after missing the past two games because of a sprained ankle. RT Rob Havenstein (ankle) and WR Davante Adams (hamstring) missed some practice time this week but should be able to play. Series notes Indianapolis has lost four straight in this series and has not won in Los Angeles — against the Rams, Chargers or Raiders — since 1986 when they defeated the Raiders 30-24. ... These franchises were involved in one of the strangest trades in sports history. The late Robert Irsay bought the Rams in July 1972 then traded his franchise to Carroll Rosenbloom in exchange for the then-Baltimore Colts. Irsay moved the Colts to Indy in 1984. Eleven years later, Rosenbloom’s widow, the late Georgia Frontiere, moved the Rams to St. Louis. The Rams returned to Los Angeles in 2016. Stats and stuff Indianapolis is 3-0 for the first time since 2009 when it opened the season with 14 consecutive wins and won the AFC title before losing in the Super Bowl to New Orleans. ... The Colts have allowed a league-low two sacks this season and have punted just once, becoming the first team since at least 1940 to have only one punt through three games. ... Jones won his first three starts with the Colts after winning just three of his previous 16 starts, all with the New York Giants. ... Pittman needs seven receptions to pass Dallas Clark (427) to take over fifth place on the franchise’s career list. ... Warren has 14 receptions and 193 yards, the most among Colts tight ends in their first three games. ... Indy’s defense is tied for the second-fewest red zone drives allowed this season (six). ... K Spencer Shrader leads the league in scoring (43 points) and field goals (11). … The Rams have 12 sacks, tied with the Broncos for most in the NFL. … Young has come out of the gates quickly, amassing four sacks and six tackles for loss to rank second in both categories. If he gets a sack Sunday, Young would match his career-long four-game streak set last season in Weeks 8-11. … Williams has scored a rushing touchdown in 12 of his past 15 home games. … Thanks in part to creative kickoffs from Joshua Karty, Los Angeles is allowing a league-low 13.5 yards per return. … Puka Nacua and Adams combined have accounted for 73.9% of the Rams’ receiving yards and 66.7% of their catches. Nacua has 29 grabs for 333 yards, and Adams has 213 yards on 13 receptions. … RB Blake Corum has set career highs in rushing yards in each of the past two weeks. He had 44 yards and his first career touchdown at Tennessee and topped it with 53 yards on eight carries at Philadelphia. Fantasy tip Jones has been one of the top surprises in the league through three games, but a good amount of his fantasy value has come from the three rushing touchdowns he scored against Miami and Denver. Taking into account how stingy the Rams were for the first 10 quarters of the season with the frustration the defense feels from the second-half struggles against the Eagles, there might be better options than Jones this week. ------ AP NFL: https://apnews.com/hub/nfl Inglewood, CA 75° 3h 6h 9h",
      "summary": "The Indianapolis Colts, 3-0 for the first time since 2009, face the Los Angeles Rams, who are 2-1, in a Sunday afternoon game. While the Colts boast a strong offense and a stingy red zone defense, the Rams' defense, particularly their pass rush, will challenge Colts QB Daniel Jones.",
      "sentiment": "Negative"
    },
    {
      "teamName": "Denver Broncos",
      "playerName": "Broncos",
      "articleTitle": "Jets vs. Dolphins, Bengals vs. Broncos: How to watch MNF on ESPN",
      "sourceURL": "https://www.espn.com/nfl/story/_/id/46367998/jets-dolphins-bengals-broncos-how-watch-monday-night-football",
      "sourceHost": "espn.com",
      "date": "2025-09-25",
      "bodyText": "Tune into \"Monday Night Football\" doubleheader Jets at Dolphins and Bengals at Broncos on ESPN. (0:30) Week 4 of the NFL schedule concludes with a \"Monday Night Football\" doubleheader featuring four AFC teams looking to right the ship. The action kicks off with the Miami Dolphins hosting the New York Jets in an AFC East clash between two squads seeking their first win of the season. In the other game, the AFC North's Cincinnati Bengals, fresh off suffering their worst blowout in franchise history, head west to take on a Denver Broncos team trying to keep pace in the race for the AFC West. Here are key facts about the Week 4 \"Monday Night Football\" doubleheader: What is the schedule? *All times Eastern Monday, Sept. 29 3 p.m.: \"NFL Live\" on ESPN 5 p.m: \"Monday Night Countdown\" on ESPN 7:15 p.m.: Jets at Dolphins on ESPN 8:15 p.m.: Bengals at Broncos on ABC How can fans watch? Fans can catch all of the action in the ESPN App and in the NFL streaming hub. New music for 'Monday Night Football' During the 2025 NFL season, multiplatinum recording artist Saweetie becomes the first woman to be music curator for \"Monday Night Football.\" The Santa Clara, California, native will handpick tracks that will be featured in live \"Monday Night Football\" broadcasts and promotional spots. Saweetie joins J Balvin (2024), Timbaland and Justin Timberlake (2023), Marshmello (2022), Drake (2021), and DJ Khaled (2020) and Diplo (2019) as \"Monday Night Football\" music curators. How can fans access more NFL content from ESPN? Check out the ESPN NFL hub page for the latest news, analysis, scores, stats, schedules and more.",
      "summary": "This Monday Night Football doubleheader features four AFC teams looking to turn their seasons around, including the Miami Dolphins hosting the New York Jets and the Cincinnati Bengals taking on the Denver Broncos. Saweetie will be the first woman to be a music curator for \"Monday Night Football\" during the 2025 NFL season.",
      "sentiment": "Positive"
    }
  ]
}